# Sesión 15 - Salarios

## Actividad Básica

### Obtener la diferencia entre el salario más alto y el más bajo dentro de los datos. Para esto, se debe encontrar el valor máximo y restarle el valor mínimo de los datos (la respuesta a esta operación se llama rango de los datos).
 

## Actividad Avanzada

### Obtener los estadísticos descriptivos de los salarios. (media, mediana, desviación estándar, etc.) Mostrar los resultados de una manera sencilla de leer para el usuario.

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict_1={
    "Nombre":["Ringo","John","Paul","George","Yoko"],
    "Edad":[45,34,42,38,47],
    "Salario":[12000,14000,13000,11000,10000],
    "Genero":["M","M","M","M","F"]
}

In [3]:
dict_1

{'Nombre': ['Ringo', 'John', 'Paul', 'George', 'Yoko'],
 'Edad': [45, 34, 42, 38, 47],
 'Salario': [12000, 14000, 13000, 11000, 10000],
 'Genero': ['M', 'M', 'M', 'M', 'F']}

In [4]:
data=pd.DataFrame(dict_1)

In [5]:
data

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [8]:
data.describe()

            Edad      Salario
count   5.000000      5.00000
mean   41.200000  12000.00000
std     5.263079   1581.13883
min    34.000000  10000.00000
25%    38.000000  11000.00000
50%    42.000000  12000.00000
75%    45.000000  13000.00000
max    47.000000  14000.00000

### salario más alto

In [13]:
dataMax = data["Salario"].max()

In [14]:
dataMax

14000

### salario más bajo

In [15]:
dataMin = data["Salario"].min()

In [16]:
dataMin

10000

### Diferencia

In [18]:
dataDif = dataMax - dataMin

In [19]:
dataDif

4000

### Estadísticos descriptivos de los salarios

In [22]:
data.describe()

            Edad      Salario
count   5.000000      5.00000
mean   41.200000  12000.00000
std     5.263079   1581.13883
min    34.000000  10000.00000
25%    38.000000  11000.00000
50%    42.000000  12000.00000
75%    45.000000  13000.00000
max    47.000000  14000.00000

In [23]:
data.count()

Nombre     5
Edad       5
Salario    5
Genero     5
dtype: int64

In [27]:
data["Salario"].mean()

12000.0

In [28]:
data["Edad"].median()

42.0

In [30]:
data.count()

Nombre     5
Edad       5
Salario    5
Genero     5
dtype: int64

In [31]:
data.sum()

Nombre     RingoJohnPaulGeorgeYoko
Edad                           206
Salario                      60000
Genero                       MMMMF
dtype: object

In [32]:
data.max()

Nombre      Yoko
Edad          47
Salario    14000
Genero         M
dtype: object

In [33]:
data.min()

Nombre     George
Edad           34
Salario     10000
Genero          F
dtype: object